"use client";
import React from "react";
import { Tabs, TabsContent, TabsList, TabsTrigger } from "../ui/tabs";
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "../ui/accordion";

type Props = {};
const accordionData = {
  general: [
    {
      id: 1,
      title: "هل يستطيع الدكتور النفسي علاج الاكتئاب بدون ادوية ؟",
      desc: "الاكتئاب له عدو أنواع، وأشدها الاكتئاب الحاد، حيث من الممكن وصف الادوية بهذه الحالة. اما الأنواع الأخرى من الاكتئاب، فيستطيع الدكتور النفسي المعالج استعمال التقنيات الحديثة في العلاج النفسي دون اللجوء للدواء. ويوجد لدينا في المنصة معالجين نفسيين ذوو خبرة كبيرة في هذا النوع من العلاجات. بإمكانك اختيار الدكتور النفسي المناسب، او بإمكانك التواصل معنا من خلال ايقونة الدردشة الزرقاء، ونحن نساعدك في اختيار الدكتور النفسي المناسب.",
    },
    {
      id: 2,
      title: "هل يستطيع الاخصائي النفسي حل المشاكل الزوجية ؟",
      desc: "غالباً ما تقع مشاكل الزواج بسبب خلافات قد تحصل بين الطرفين. ولكن في بعض الأحيان قد يكون السبب غير معلوم! أي لا توجد مشكلة حقيقية، بل ناتج عن مشكلة نفسية عند أحد الطرفين او كلاهما ربما. وبالتأكيد في هذه الحالة للأخصائي النفسي دور هام في علاج هذه المشاكل، وإعادة العلاقة التي تجمع الزوجين إلى طبيعتها السابقة. أن كنت تجد صعوبة في اختيار الاخصائي! تواصل معنا من خلال ايقونة الدردشة الزرقاء، ونحن سوف نساعدك على اختيار الاخصائي النفسي المناسب.",
    },
    {
      id: 3,
      title: "هل يستطيع الدكتور النفساني علاج القلق ؟",
      desc: "القلق مشكلة نفسية منتشرة جدا في المجتمع، وله أنواع كثيرة لا حصر لذكرها الان. ولكل نوع من أنواع القلق أليات علاجية نفسية مختلفة. في بعض الأحيان يتم اللجوء إلى الادوية، او فقط للعلاج النفسي، او ربما للاثنين معاً. ونوع القلق الذي تعاني منه وشدته يشخصه المعالج النفسي. في منصة نفسي فيرتول النفسية يوجد لدينا أكثر من 12 دكتور نفساني ذوو خبرة كبيرة في علاج أنواع القلق. بإمكانك الاختيار، او التحدث معنا من خلال ايقونة الدردشة الزرقاء، وسوف نساعدك باختيار الدكتور النفساني",
    },
    {
      id: 4,
      title: "هل يستطيع المعالج النفسي علاج الوسواس القهري ؟",
      desc: "الوسواس القهري هو نوع من الاضطرابات المرتبطة بالقلق، والمصابين بهذا النوع في الغالب يشعرون بان افعالهم لا منطقية ويحاولون تغييرها، والدليل هو أنك انت الان تبحث عن علاج لمشكلتك هذه وتقوم بقراءة هذا الوصف. يستطيع المعالج النفسي التخفيف من هذا الوسواس بدرجة كبيرة من خلال العلاجات النفسية التي تعتمد على التقنيات النفسية الحديثة. بإمكانك اختيار أحد المعالجين النفسيين في الموقع، او ان اردت يمكن التواصل معنا من خلال ايقونة الدردشة الزرقاء الظاهرة أمامك، وسوف نساعدك باختيار المعالج المناسب.",
    },
    {
      id: 5,
      title: "هل يوجد طبيب نفسي يعالج الشذوذ ؟",
      desc: "الشذوذ الجنسي هو قضية لا تزال الى اليوم بين شد وجذب، هناك من يعتبرها مرض، وهناك من يعتبرها حالة طبيعية. في المجتمعات الغربية لا يزال الكثير يضهد هذه الفئة، بأشكال مختلفة كالسخرية وحتى بالإساءات اللفظية. فما بالكم بمجتمعنا العربي؟ بالتأكيد الاضطهاد والرفض سوف يكون مضاعف، بل قد يصل للاعتداءات الجسدية. ببساطة وبغض النظر عن طبيعة حالة الفئة هذه، ان كانت مرضية او وراثية او تربوية، او طبيعية. هم بالنهاية هكذا شانا أم أبينا، مشاعرهم هكذا ولن يغيرها رأيك او نظرتك. هذه الفئة في مجتمعنا العربي بحاجة للدعم النفسي كي تتصالح مع نفسها، ولكي تتعلم تقنيات المواجهة. بإمكانك الأطباء النفسيين والاخصائيين في منصتنا مساعدة هذه الفئة من الناس، بكل بساطة اختر أحد الأطباء وبالتأكيد سوف يكون داعم لك وسوف يساعدك نفسيا بالتعرف على نفسك أكثر. أو ان اردت تواصل معنا من خلال ايقونة الدردشة الزرقاء الظاهرة امامك، ونحن سوف نقترح لك الطبيب النفسي المناسب.",
    },
  ],
  sessions: [
    {
      id: 1,
      title: "ما هو عدد الجلسات النفسية التي احتاجها حتى اتماثل للشفاء ؟",
      desc: "هذا الامر ملتبس عند نسبة كبيرة من المراجعين، يعتقدون ان مشكلتهم النفسية سوف يتم الشفاء منها من الجلسة الأولى. في الحقيقة وخاصة بالعلاج النفسي، لا يستطيع المعالج حل مشكلتك النفسية من جلسة واحدة. انت تحتاج لعدة جلسات قد تصل من 2 الى 10 جلسات، وربما برنامج كامل قد يمتد لشهرين او 3 أشهر، على ان تكون جلسة او اثنين كل أسبوع . هذا يتوقف على المشكلة النفسية التي تعاني منها.",
    },
    {
      id: 2,
      title: "كيف يتم التواصل مع دكتور نفسي ؟",
      desc: "يتم التواصل مع دكتور نفسي من خلال طريقتين، الأولى ان تتوجه إلى عيادة طبيب نفسي في المدينة التي تسكن بها. اما الطريقة الثانية فهي التواصل مع طبيب نفسي اونلاين، وهذا الخيار الأكثر رواجا في العامين الأخيرين، بسبب الفائدة العلاجية التي يحصل عليها المريض من خلال الجلسات النفسية عبر الانترنت. المريض يكون مرتاح ومسترخي أكثر مما يكون عليه في العيادات التي لا تزال الى يومنا هذا متمسكة بالرتابة المصطنعة. بكل بساطة وانت جالس في غرفتك ومن خلال الهاتف او الكمبيوتر، بكبسة زر واحدة تقوم بالحجز والتواصل مع الدكتور النفسي صوت وصورة او صوت فقط ان كنت تحبذ هذا.",
    },
    {
      id: 3,
      title: "متى يجب التحدث مع طبيب نفسي ؟",
      desc: "يجب عليك التحدث مع الطبيب النفسي في عدة حالات نذكر منها، قلة النوم، كثرة التفكير، الاستشارات، الحزن المبالغ به والذي يأتي بدون سبب. أيضاً ميلك للعزلة وشعورك بالاكتئاب، تدني الإنتاجية العملية او الفكرية. مشاكل الزواج التي تحدث دون أي سبب وجيه. القلق الشديد، الخوف الشديد، سماع الأصوات او رؤية أشياء لا يراها سواك. او من اجل الاطمئنان على الحالة النفسية. بإمكانك التحدث مع طبيب نفسي بسهولة من خلال موقع نفسي فيرتول للعلاج النفسي. كل ما عليك فعله هو التوجه الى صفحة الأطباء واختيار الطبيب. أو ان واجهة مشكلة بالاختيار، قم بالتواصل معنا من خلال ايقونة الدردشة الزرقاء الظاهرة امامك، ونحن سوف نساعدك بالاختيار ومن ثم التحدث مع الطبيب النفسي.",
    },
  ],
};

export default function FAQ({}: Props) {
  return (
    <div className="content bg-[#e5e5e5] dark:bg-[#020817] rounded-xl my-4">
      <Tabs defaultValue="general" dir="rtl" className="breakout">
        <TabsList className="grid w-full grid-cols-2">
          <TabsTrigger value="general">
            اسئلة حول العلاج في موقع نفسي فيرتول
          </TabsTrigger>
          <TabsTrigger value="sessions">
            اسئلة حول الجلسات مع الاخصائي النفسي
          </TabsTrigger>
        </TabsList>
        <TabsContent value="general">
          <Accordion type="single" collapsible className="w-full">
            {accordionData["general"].map(({ id, title, desc }, ind) => (
              <AccordionItem value={"item-" + (ind + 1)} key={id}>
                <AccordionTrigger>{title}</AccordionTrigger>
                <AccordionContent>{desc}</AccordionContent>
              </AccordionItem>
            ))}
          </Accordion>
        </TabsContent>
        <TabsContent value="sessions">
          <Accordion type="single" collapsible className="w-full">
            {accordionData["sessions"].map(({ id, title, desc }, ind) => (
              <AccordionItem value={"item-" + (ind + 1)} key={id}>
                <AccordionTrigger>{title}</AccordionTrigger>
                <AccordionContent>{desc}</AccordionContent>
              </AccordionItem>
            ))}
          </Accordion>
        </TabsContent>
      </Tabs>
    </div>
  );
}
